<#include "./common/layout.ftl">
<@html page_title="注册协议" page_tab="agree">
<div class="row">
  <div class="col-md-9">
    <div class="panel panel-default">
      <div class="panel-heading">
        <a href="/">主页</a> / 注册协议
      </div>
      <div class="panel-body">
        <#if errors??>
        <div class="alert alert-danger">${errors!}</div>
        </#if>


    星宝日记用户注册协议
 
一、总则  
  1.1 用户在使用星宝日记网站（以下简称本网站）的服务之前，应当仔细阅读本协议，并同意遵守本协议及所有网站规则后方可成为星宝日记用户，一旦用户注册成功，则用户与本网站之间自动形成协议关系，用户应当受本协议及所有网站规则的约束。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。 
  1.2 本协议、网站规则可由本网站随时更新，用户在使用星宝日记产品时应当及时关注，用户同意本网站不承担通知义务。本网站的通知、公告、声明或其它类似内容是本协议及网站规则的一部分。
 二、服务内容  
  2.1 本网站网络服务的具体内容由本网站根据实情况提供，例如论坛、分类信息等。  
  2.2 本网站提供的所有服务均免费，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。 
三、用户帐号  
    3.1 用户可通过以下方式注册成为星宝日记网站的正式用户：        
    (1)经本网站会员系统完成注册程序并通过身份认证的用户；         成为星宝日记正式用户即获得本网站规定用户所应享有的一切权限；未经认证仅享有本网站规定的部分会员权限。星宝日记网站有权对会员的权限设计进行变更。 
    3.2 用户帐号注册        (1)使用本网站会员系统注册的用户，只能使用汉字、英文字母、数字、下划线及它们的组合，禁止使用空格、各种符号和特殊字符，且最多不超过16个字符(8个汉字)注册，否则将不予注册。        (2)使用第三方合作网站登录的用户，只能使用汉字、英文字母、数字、下划线及它们的组合，禁止使用空格、各种符号和特殊字符，且最多不超过14个字符(7个汉字)注册，否则本网站有权只截取前14个字符（7个汉字）予以显示用户帐号（若该用户帐号与网站现有用户帐号重名，系统将随机添加一个字符以示区别），否则将不予注册。  
    3.3 如发现用户帐号中含有不雅文字或不恰当名称的，本网站保留取消其用户资格的权利。 
    (1)请勿以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；       
    (2)请勿以国家机构或其他机构的名称注册；        
    (3)请勿注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的帐号；       
    (4)请勿注册易产生歧义、引起他人误解或其它不符合法律规定的帐号。  
    3.4 用户帐号的所有权归本网站，用户仅享有使用权。3个月未使用的用户帐号，本网站保留收回的权利。  
    3.5 用户有义务保证密码和帐号的安全，用户利用该密码和帐号所进行的一切活动引起的任何损失或损害，由用户自行承担全部责任，本网站不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请通知本网站。因黑客行为或用户的保管疏忽导致帐号非法使用，本网站不承担任何责任。 
四、使用规则  
    4.1 遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》等有关计算机互联网规定和知识产权的法律和法规、实施办法。  
    4.2 用户对其自行发表、上传或传送的内容负全部责任，所有用户不得在本网站任何页面发布、转载、传送含有下列内容之一的信息，否则本网站有权自行处理并不通知用户：       (1)违反宪法确定的基本原则的；        (2)危害国家安全，泄漏国家机密，颠覆国家政权，破坏国家统一的；       (3)损害国家荣誉和利益的；        (4)煽动民族仇恨、民族歧视，破坏民族团结的；       (5)破坏国家宗教政策，宣扬邪教和封建迷信的；       (6)散布谣言，扰乱社会秩序，破坏社会稳定的；       (7)散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；       (8)侮辱或者诽谤他人，侵害他人合法权益的；        (9)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；       (10)以非法民间组织名义活动的；        (11)含有法律、行政法规禁止的其他内容的。 
    4.3 用户承诺对其发表或者上传于本网站的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；如用户违反本条规定造成本网站被第三人索赔的，用户应全额补偿本网站一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)；  
    4.4 当第三方认为用户发表或者上传于本网站的信息侵犯其权利，并根据《信息网络传播权保护条例》或者相关法律规定向本网站发送权利通知书时，用户同意本网站可以自行判断决定删除涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性，本网站将不会自动恢
    复上述删除的信息；        (1)不得为任何非法目的而使用网络服务系统；       (2)遵守所有与网络服务有关的网络协议、规定和程序；        (3)不得利用本网站服务进行任何可能对互联网的正常运转造成不利影响的行为；       (4)不得利用本网站服务进行任何不利于本网站的行为。  
    4.5 如用户在使用网络服务时违反上述任何规定，本网站有权要求用户改正或直接采取一切必要的措施(包括但不限于删除用户张贴的内容、暂停或终止用户使用网络服务的权利)以减轻用户不当行为而造成的影响。 
五、隐私保护  
   5.1 本网站不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本网站的非公开内容，但下列情况除外：       (1)事先获得用户的明确授权；       (2)  根据有关的法律法规要求；       (3)按照相关政府主管部门的要求；       (4)为维护社会公众的利益。  
   5.2 本网站可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本网站同等的保护用户隐私的责任，则本网站有权将用户的注册资料等提供给该第三方。  
   5.3 在不透露单个用户隐私资料的前提下，本网站有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
  六、版权声明  
     6.1 用户发表并将其上传到本网站的任何内容，本网站在全世界范围内不限形式和载体地享有永久的、不可撤销的、免费的、非独家的使用权和转授权的权利，包括但不限于修改、复制、发行、展览、改编、汇编、出版、翻译、信息网络传播、广播、表演和再创作及著作权法等法律法规确定的其他权利。  
     6.2 本网站特有的标识、版面设计、编排方式等版权均属本网站享有，未经本网站许可，不得任意复制或转载。  
     6.3 用户从本网站的服务中获得的信息，未经本网站许可，不得任意复制或转载。 
     6.4 使用本网站的任何内容均应注明"来源于星宝日记网站(www.xingbaoriji.com)"及署上作者姓名，按法律规定需要支付稿酬的，应当通知本网站及作者及支付稿酬，并独立承担一切法律责任。 
     6.5 本网站享有所有作品用于其它用途的使用权和优先权，包括但不限于网站、电子杂志、平面出版等，作者在本网站发布内容时视为同意本条款。  
     6.6 本网站所有内容仅代表作者自己的立场和观点，与本网站无关，由作者本人承担一切法律责任。  
     6.7 恶意转载本网站内容的，本网站保留将其诉诸法律的权利。
  七、责任声明  7.1 用户明确同意其使用本网站网络服务所存在的风险及一切后果将完全由用户本人承担，本网站对此不承担任何责任。
  
      </div>
    </div>
  </div>
</div>

</@html>